package If_Statement;

import org.w3c.dom.ls.LSOutput;

public class HW3 {

    public static void main(String[] args) {

        /*
        Задача №1

Необходимо создать две целочисленные переменные (a, b), присвоить произвольные значения переменным на ваш выбор и вывести следующие строки:
a == b - если переменные равны
a < b - если переменная a меньше b
a > b - если переменная b меньше a

         */

        int a = 343;
        int b = 3330;

        if (a == b) {
            System.out.println("a == b - если переменные равны");
        } else if (a < b) {
            System.out.println("a < b - если переменная a меньше b");
        } else {
            System.out.println("a > b - если переменная b меньше a");
        }


            /*

Задача №2

Необходимо создать две целочисленные переменные (a, b), присвоить произвольные значения переменным на ваш выбор и вывести следующие строки:
maybe a and b are even - если сумма переменных четная
some variable is odd - если сумма переменных нечетная

     */

        int sum = a+b;

        if (sum % 2 == 0){
            System.out.println("maybe a and b are even");

        } else{
            System.out.println("some variable is odd");
        }


        /*
        Необходимо создать целочисленную переменную, присвоить произвольное значение переменной на ваш выбор и вывести следующие строки:
больше 10 - если переменная больше 10
меньше 100 - если переменная меньше 100
результат деления на 2 больше 20 - если это соответствует истине
значение переменной между 5 и 40 включительно - если это правда
значение переменной меньше 5 или больше 40 - если предыдущие условие ложное

         */

        int c = 60;

        if (c > 10){
            System.out.println("больше 10");

        } if (c < 100){
            System.out.println("меньше 100");
        } if (c / 2.0  > 20){
            System.out.println("результат деления на 2 больше 20");
        }

        if (c>=5 && c<= 40){
            System.out.println("значение переменной между 5 и 40 включительно");
        } else {
            System.out.println("значение переменной меньше 5 или больше 40");
        }

        /*
        Необходимо вывести числа от 0 до 15.
         */
        for( int i = 0; i < 16; i+=1){
            System.out.println(i);
        }

        /*
        Задача №2

Необходимо вывести все положительные степени числа 5 которые меньше 10000, вывести результат возведения в степень.

         */

        for( int i = 5; i < 10000; i*=5)
            System.out.println(i);


        /*
        Задача №3

Необходимо вывести все числа кратные 4 между числами 40 и 60 включительно.
Реализовать 2 варианта:
использовать конструкцию if для определения кратности (цикл с шагом 1, i = i + 1);
без использования конструкции if (шаг цикла на ваше усмотрение).

         */
//test
        for( int i = 40; i < 61; i+=1){
            if(i % 4 == 0){
                System.out.println(i);
            }

        }

        for(int i = 40; i < 61; i+=4){
            System.out.println(i);
        }


    }
}




