package If_Statement;

public class taskFromGPT {
    public static void main(String[] args) {
        //findSimple();
        findSum();
    }

    /**
     * Задача 1: Проверка четных и нечетных чисел
     * Задание: Напишите программу, которая выводит все числа от 1 до 50 и указывает, четное это число или нечетное.
     * Подсказка:
     * Используйте цикл for для итерации по числам от 1 до 50.
     * Внутри цикла используйте конструкцию if-else для проверки четности числа.
     **/
    private static void findSimple() {
        for (int i = 1; i < 51; i += 1) {
            if (i % 2 == 0) {
                System.out.println(i + " четное");
            } else {
                System.out.println(i + " нечетное");
            }
        }
    }

    /**
     * Задача 2: Сумма четных и нечетных чисел
     * Задача 2: Сумма четных и нечетных чисел
     * Задание: Напишите программу, которая находит сумму всех четных и нечетных чисел в диапазоне от 1 до 100.
     * Подсказка:
     * Используйте цикл for для перебора чисел.
     * Внутри цикла используйте if-else для определения, четное ли число, и прибавляйте его к соответствующей сумме.
     **/
    public static void findSum() {
        int a = 0;
        int b = 0;
        for (int i = 1; i < 101; i += 1) {
            if (i % 2 == 0) {
                a += i;
            } else {
                b += i;

            }
        }
        System.out.println("Сумма четных чисел =  " + a);
        System.out.println("Сумма нечетных  чисел = " + b);

    }


}
