package Les5_Reference_type;

public class HW5_2 {
    public static void main(String[] args) {
        //Task_1();
        //Task_2();


    }

    /**
     * Задача №1
     * <p>
     * Дана строка:
     * String s = “Перестановочный алгоритм быстрого действия”;
     * необходимо вывести все буквы “о” из этой строки.
     * Для указанной строки ответ будет “ооооо” (или в столбик)
     **/

    public static void Task_1() {
        String s = "Перестановочный алгоритм быстрого действия";

        for (int i = 0; i < s.length(); i++) {
            if (s.charAt(i) == 'о') {
                System.out.println("о");
            }
        }
    }

    /**
     * Задача №2
     * <p>
     * Дана строка:
     * String s = “Перевыборы выбранного президента”;
     * необходимо подсчитать количество букв “е” в строке.
     * Для указанной строки ответ будет 4.
     **/

    public static void Task_2() {
        String s = "Перевыборы выбранного президента";
        int count = 0;

        for (int i = 0; i < s.length(); i++) {
            if (s.charAt(i) == 'е') {
                count++;
            }
        }
        System.out.println(count);
    }

    /**
     * Экстра задача №1
     *
     * Дана строка:
     * String s = “Посмотрите как Рите нравится ритм”;
     * необходимо вывести индексы начала всех подстрок - “рит”, независимо от регистра.
     * Для указанной строки ответ будет 6, 15, 29.
     **/

    public static void Task_3() {
        String s = "Посмотрите как Рите нравится ритм";

    }
}
